Revit 2027 API
Dimension.Segments Property
The segments in the dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DimensionSegmentArray Segments { get; }
Public ReadOnly Property Segments As DimensionSegmentArray
	Get
public:
property DimensionSegmentArray^ Segments {
	DimensionSegmentArray^ get ();
}
member Segments : DimensionSegmentArray with get
Property Value
DimensionSegmentArray
Remarks
Returns a read only array of segments in the dimension. The references of the dimension can be mapped to segments in order. The first segment here wrapped by first and second references; the nth segment is wrapped by nth and n+1st references.
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace